In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from main import *

In [2]:
sql_file_path = 'queries/1_job_comparison.sql'

In [3]:
queries = read_sql_file(sql_file_path)
connection = connect_to_database()

if connection:
    tables = execute_queries(connection, queries)
    connection.close()

All queries executed successfully!

In [7]:
tables[3]

    skill_id  job_count  skill_name
0          0       7291         sql
1        181       4611       excel
2          1       4330      python
3        182       3745     tableau
4        183       2609    power bi
5          5       2142           r
6          7        933         sas
7        185        868      looker
8         74        821       azure
9        196        819  powerpoint
10         8        815          go
11        76        769         aws
12       188        720        word
13        79        619      oracle
14        80        608   snowflake